Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0032GPL036.atdf
         <register caption="" name="CCP2CON1" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP2CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP3CON1" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP3CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP1CON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP1CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP1CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP1CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP1CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x02000000" name="OCBEN" />
            <bitfield caption="" mask="0x04000000" name="OCCEN" />
            <bitfield caption="" mask="0x08000000" name="OCDEN" />
            <bitfield caption="" mask="0x10000000" name="OCEEN" />
            <bitfield caption="" mask="0x20000000" name="OCFEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP1CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP2CON2" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP2CON2__ASDG" />
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" />
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" />
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP2CON2__ICS" />
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" />
         </register>
         <register caption="" name="CCP3CON2" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP3CON2__ASDG" />
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" />
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" />
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP3CON2__ICS" />
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" />
         </register>
         <register caption="" name="CCP1CON3" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x0000003F" name="DT" />
            <bitfield caption="" mask="0x00030000" name="PSSBDF" />
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP1CON3__PSSACE"/>
            <bitfield caption="" mask="0x00100000" name="POLBDF" />
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP1CON3_POLACE"/>
            <bitfield caption="" mask="0x07000000" name="OUTM" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP2CON3" offset="0x120" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" />
            <bitfield caption="" mask="0x00200000" name="POLACE" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP3CON3" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" />
            <bitfield caption="" mask="0x00200000" name="POLACE" />
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
