Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0032GPL036.atdf
      <value-group caption="CLCx Data Output Status bit" name="CLC2CON__LCOUT">
         <value caption="CLCx output high" name="" value="0x1" />
         <value caption="CLCx output low" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Port Enable bit" name="CLC2CON__LCOE">
         <value caption="CLCx port pin output is enabled" name="" value="0x1" />
         <value caption="CLCx port pin output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Negative Edge Interrupt Enable bit" name="CLC2CON__INTN">
         <value caption="Interrupt will be generated when a falling edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Positive Edge Interrupt Enable bit" name="CLC2CON__INTP">
         <value caption="Interrupt will be generated when a rising edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Enable bit" name="CLC2CON__ON">
         <value caption="CLCx is enabled and mixing input signals" name="" value="0x1" />
         <value caption="CLCx is disabled and has logic zero outputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Polarity Control bit" name="CLC2CON__G1POL">
         <value caption="The output of Channel 1 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 1 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Polarity Control bit" name="CLC2CON__G2POL">
         <value caption="The output of Channel 2 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 2 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Polarity Control bit" name="CLC2CON__G3POL">
         <value caption="The output of Channel 3 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 3 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Polarity Control bit" name="CLC2CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC1SEL__DS1">
         <value caption="MCCP1 OCM1C Output" name="" value="0x7" />
         <value caption="MCCP1 OCM1B Output" name="" value="0x6" />
         <value caption="MCCP1 OCM1A Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC1SEL__DS2">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="UART1 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC1SEL__DS3">
         <value caption="SCCP3 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP2 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP2 OCM2 output" name="" value="0x5" />
         <value caption="UART1 RX In" name="" value="0x4" />
         <value caption="SPI1 SDO1 Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC1 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC1SEL__DS4">
         <value caption="SCCP3 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="SCCP3 OCM3 output" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC2SEL__DS1">
         <value caption="MCCP1 OCM1F Output" name="" value="0x7" />
         <value caption="MCCP1 OCM1E Output" name="" value="0x6" />
         <value caption="MCCP1 OCM1D Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC2SEL__DS2">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="UART2 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC1 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
