Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0032GPL036.atdf
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI2CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDI bit" name="SPI2CON__DISSDI">
         <value caption="SDI pin is not used by the SPI module (pin is controlled by PORT function)" name="" value="0x1" />
         <value caption="SDI pin is controlled by the SPI module" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Enable bit" name="SPI2CON__MSTEN">
         <value caption="Master mode" name="" value="0x1" />
         <value caption="Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI2CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1" />
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI2CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1" />
         <value caption="SSx pin not used for Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Clock Edge Select bit" name="SPI2CON__CKE">
         <value caption="Serial output data changes on transition from active clock state to Idle clock state (see CKP bit)" name="" value="0x1" />
         <value caption="Serial output data changes on transition from Idle clock state to active clock state (see CKP bit)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Data Input Sample Phase bit (master mode only)" name="SPI2CON__SMP">
         <value caption="(Master mode) Input data sampled at end of data output time / (Slave mode) value is ignored" name="" value="0x1" />
         <value caption="(Master mode) Input data sampled at middle of data output time / (Slave mode) value is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="32/16-Bit Communication Select bits" name="SPI2CON__MODE32">
         <value caption="(AUDEN=1) 24-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 32-bit communication" name="" value="0x3" />
         <value caption="(AUDEN=1) 32-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 32-bit communication" name="" value="0x2" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 16-bit communication" name="" value="0x1" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 16-bit Channel/32-bit Frame / (AUDEN=0) 8-bit communication" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDOx pin bit" name="SPI2CON__DISSDO">
         <value caption="SDOx pin is not used by the module. Pin is controlled by associated PORT register" name="" value="0x1" />
         <value caption="SDOx pin is controlled by the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="SPI2CON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Peripheral On bit" name="SPI2CON__ON">
         <value caption="SPI Peripheral is enabled" name="" value="0x1" />
         <value caption="SPI Peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enhanced Buffer Enable bit" name="SPI2CON__ENHBUF">
         <value caption="Enhanced Buffer mode is enabled" name="" value="0x1" />
         <value caption="Enhanced Buffer mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Edge Select bit" name="SPI2CON__SPIFE">
         <value caption="Frame synchronization pulse coincides with the first bit clock" name="" value="0x1" />
         <value caption="Frame synchronization pulse precedes the first bit clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Clock Enable bit" name="SPI2CON__MCLKSEL">
         <value caption="REFCLK is used by the Baud Rate Generator" name="" value="0x1" />
         <value caption="PBCLK is used by the Baud Rate Generator" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." name="SPI2CON__FRMCNT">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Generate a frame sync pulse on every 32 data characters" name="" value="0x5" />
         <value caption="Generate a frame sync pulse on every 16 data characters" name="" value="0x4" />
         <value caption="Generate a frame sync pulse on every 8 data characters" name="" value="0x3" />
         <value caption="Generate a frame sync pulse on every 4 data characters" name="" value="0x2" />
         <value caption="Generate a frame sync pulse on every 2 data characters" name="" value="0x1" />
         <value caption="Generate a frame sync pulse on every data character" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Width bit" name="SPI2CON__FRMSYPW">
         <value caption="Frame sync pulse is one character wide" name="" value="0x1" />
         <value caption="Frame sync pulse is one clock wide" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Slave Select Enable bit" name="SPI2CON__MSSEN">
         <value caption="Slave select SPI support enabled. The SS pin is automatically driven during transmission in Master mode. Polarity is determined by the FRMPOL bit." name="" value="0x1" />
         <value caption="Slave select SPI support is disabled." name="" value="0x0" />
      </value-group>
